zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC5506JBD64-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from LPC5506JBD64/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on LPC55S69JBD100-pinctrl.h with this part's differences applied
 * below (1049 removed, 0 changed,
 * 6 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d0fef7b5a4939490
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC5506JBD64_WRAPPER_
#define _ZEPHYR_DTS_BINDING_LPC5506JBD64_WRAPPER_

#include "LPC55S69JBD100-pinctrl.h"

/* Signals not present on this part */
#undef ACMPVREF_PIO1_19
#undef ADC0_CH4_PIO1_8
#undef CLKOUT_PIO1_27
#undef CTIMER0_CAPTURE0_PIO1_13
#undef CTIMER0_CAPTURE0_PIO1_15
#undef CTIMER0_CAPTURE0_PIO1_20
#undef CTIMER0_CAPTURE0_PIO1_26
#undef CTIMER0_CAPTURE0_PIO1_28
#undef CTIMER0_CAPTURE1_PIO1_13
#undef CTIMER0_CAPTURE1_PIO1_15
#undef CTIMER0_CAPTURE1_PIO1_20
#undef CTIMER0_CAPTURE1_PIO1_26
#undef CTIMER0_CAPTURE1_PIO1_28
#undef CTIMER0_CAPTURE2_PIO1_13
#undef CTIMER0_CAPTURE2_PIO1_15
#undef CTIMER0_CAPTURE2_PIO1_20
#undef CTIMER0_CAPTURE2_PIO1_26
#undef CTIMER0_CAPTURE2_PIO1_28
#undef CTIMER0_CAPTURE3_PIO1_13
#undef CTIMER0_CAPTURE3_PIO1_15
#undef CTIMER0_CAPTURE3_PIO1_20
#undef CTIMER0_CAPTURE3_PIO1_26
#undef CTIMER0_CAPTURE3_PIO1_28
#undef CTIMER0_MATCH2_PIO1_31
#undef CTIMER0_MATCH3_PIO1_27
#undef CTIMER1_CAPTURE0_PIO1_13
#undef CTIMER1_CAPTURE0_PIO1_15
#undef CTIMER1_CAPTURE0_PIO1_20
#undef CTIMER1_CAPTURE0_PIO1_26
#undef CTIMER1_CAPTURE0_PIO1_28
#undef CTIMER1_CAPTURE1_PIO1_13
#undef CTIMER1_CAPTURE1_PIO1_15
#undef CTIMER1_CAPTURE1_PIO1_20
#undef CTIMER1_CAPTURE1_PIO1_26
#undef CTIMER1_CAPTURE1_PIO1_28
#undef CTIMER1_CAPTURE2_PIO1_13
#undef CTIMER1_CAPTURE2_PIO1_15
#undef CTIMER1_CAPTURE2_PIO1_20
#undef CTIMER1_CAPTURE2_PIO1_26
#undef CTIMER1_CAPTURE2_PIO1_28
#undef CTIMER1_CAPTURE3_PIO1_13
#undef CTIMER1_CAPTURE3_PIO1_15
#undef CTIMER1_CAPTURE3_PIO1_20
#undef CTIMER1_CAPTURE3_PIO1_26
#undef CTIMER1_CAPTURE3_PIO1_28
#undef CTIMER1_MATCH1_PIO1_12
#undef CTIMER1_MATCH2_PIO1_14
#undef CTIMER1_MATCH3_PIO1_16
#undef CTIMER2_CAPTURE0_PIO1_13
#undef CTIMER2_CAPTURE0_PIO1_15
#undef CTIMER2_CAPTURE0_PIO1_20
#undef CTIMER2_CAPTURE0_PIO1_26
#undef CTIMER2_CAPTURE0_PIO1_28
#undef CTIMER2_CAPTURE1_PIO1_13
#undef CTIMER2_CAPTURE1_PIO1_15
#undef CTIMER2_CAPTURE1_PIO1_20
#undef CTIMER2_CAPTURE1_PIO1_26
#undef CTIMER2_CAPTURE1_PIO1_28
#undef CTIMER2_CAPTURE2_PIO1_13
#undef CTIMER2_CAPTURE2_PIO1_15
#undef CTIMER2_CAPTURE2_PIO1_20
#undef CTIMER2_CAPTURE2_PIO1_26
#undef CTIMER2_CAPTURE2_PIO1_28
#undef CTIMER2_CAPTURE3_PIO1_13
#undef CTIMER2_CAPTURE3_PIO1_15
#undef CTIMER2_CAPTURE3_PIO1_20
#undef CTIMER2_CAPTURE3_PIO1_26
#undef CTIMER2_CAPTURE3_PIO1_28
#undef CTIMER2_MATCH1_PIO1_6
#undef CTIMER2_MATCH2_PIO1_7
#undef CTIMER3_CAPTURE0_PIO1_13
#undef CTIMER3_CAPTURE0_PIO1_15
#undef CTIMER3_CAPTURE0_PIO1_20
#undef CTIMER3_CAPTURE0_PIO1_26
#undef CTIMER3_CAPTURE0_PIO1_28
#undef CTIMER3_CAPTURE1_PIO1_13
#undef CTIMER3_CAPTURE1_PIO1_15
#undef CTIMER3_CAPTURE1_PIO1_20
#undef CTIMER3_CAPTURE1_PIO1_26
#undef CTIMER3_CAPTURE1_PIO1_28
#undef CTIMER3_CAPTURE2_PIO1_13
#undef CTIMER3_CAPTURE2_PIO1_15
#undef CTIMER3_CAPTURE2_PIO1_20
#undef CTIMER3_CAPTURE2_PIO1_26
#undef CTIMER3_CAPTURE2_PIO1_28
#undef CTIMER3_CAPTURE3_PIO1_13
#undef CTIMER3_CAPTURE3_PIO1_15
#undef CTIMER3_CAPTURE3_PIO1_20
#undef CTIMER3_CAPTURE3_PIO1_26
#undef CTIMER3_CAPTURE3_PIO1_28
#undef CTIMER3_MATCH1_PIO1_19
#undef CTIMER4_CAPTURE0_PIO1_13
#undef CTIMER4_CAPTURE0_PIO1_15
#undef CTIMER4_CAPTURE0_PIO1_20
#undef CTIMER4_CAPTURE0_PIO1_26
#undef CTIMER4_CAPTURE0_PIO1_28
#undef CTIMER4_CAPTURE1_PIO1_13
#undef CTIMER4_CAPTURE1_PIO1_15
#undef CTIMER4_CAPTURE1_PIO1_20
#undef CTIMER4_CAPTURE1_PIO1_26
#undef CTIMER4_CAPTURE1_PIO1_28
#undef CTIMER4_CAPTURE2_PIO1_13
#undef CTIMER4_CAPTURE2_PIO1_15
#undef CTIMER4_CAPTURE2_PIO1_20
#undef CTIMER4_CAPTURE2_PIO1_26
#undef CTIMER4_CAPTURE2_PIO1_28
#undef CTIMER4_CAPTURE3_PIO1_13
#undef CTIMER4_CAPTURE3_PIO1_15
#undef CTIMER4_CAPTURE3_PIO1_20
#undef CTIMER4_CAPTURE3_PIO1_26
#undef CTIMER4_CAPTURE3_PIO1_28
#undef DMA0_TRIG00_PIO0_17
#undef DMA0_TRIG00_PIO1_12
#undef DMA0_TRIG00_PIO1_13
#undef DMA0_TRIG00_PIO1_14
#undef DMA0_TRIG00_PIO1_15
#undef DMA0_TRIG00_PIO1_16
#undef DMA0_TRIG00_PIO1_17
#undef DMA0_TRIG00_PIO1_18
#undef DMA0_TRIG00_PIO1_19
#undef DMA0_TRIG00_PIO1_20
#undef DMA0_TRIG00_PIO1_24
#undef DMA0_TRIG00_PIO1_26
#undef DMA0_TRIG00_PIO1_27
#undef DMA0_TRIG00_PIO1_28
#undef DMA0_TRIG00_PIO1_30
#undef DMA0_TRIG00_PIO1_31
#undef DMA0_TRIG00_PIO1_6
#undef DMA0_TRIG00_PIO1_7
#undef DMA0_TRIG00_PIO1_8
#undef DMA0_TRIG010_PIO0_17
#undef DMA0_TRIG010_PIO1_12
#undef DMA0_TRIG010_PIO1_13
#undef DMA0_TRIG010_PIO1_14
#undef DMA0_TRIG010_PIO1_15
#undef DMA0_TRIG010_PIO1_16
#undef DMA0_TRIG010_PIO1_17
#undef DMA0_TRIG010_PIO1_18
#undef DMA0_TRIG010_PIO1_19
#undef DMA0_TRIG010_PIO1_20
#undef DMA0_TRIG010_PIO1_24
#undef DMA0_TRIG010_PIO1_26
#undef DMA0_TRIG010_PIO1_27
#undef DMA0_TRIG010_PIO1_28
#undef DMA0_TRIG010_PIO1_30
#undef DMA0_TRIG010_PIO1_31
#undef DMA0_TRIG010_PIO1_6
#undef DMA0_TRIG010_PIO1_7
#undef DMA0_TRIG010_PIO1_8
#undef DMA0_TRIG011_PIO0_17
#undef DMA0_TRIG011_PIO1_12
#undef DMA0_TRIG011_PIO1_13
#undef DMA0_TRIG011_PIO1_14
#undef DMA0_TRIG011_PIO1_15
#undef DMA0_TRIG011_PIO1_16
#undef DMA0_TRIG011_PIO1_17
#undef DMA0_TRIG011_PIO1_18
#undef DMA0_TRIG011_PIO1_19
#undef DMA0_TRIG011_PIO1_20
#undef DMA0_TRIG011_PIO1_24
#undef DMA0_TRIG011_PIO1_26
#undef DMA0_TRIG011_PIO1_27
#undef DMA0_TRIG011_PIO1_28
#undef DMA0_TRIG011_PIO1_30
#undef DMA0_TRIG011_PIO1_31
#undef DMA0_TRIG011_PIO1_6
#undef DMA0_TRIG011_PIO1_7
#undef DMA0_TRIG011_PIO1_8
#undef DMA0_TRIG012_PIO0_17
#undef DMA0_TRIG012_PIO1_12
#undef DMA0_TRIG012_PIO1_13
#undef DMA0_TRIG012_PIO1_14
#undef DMA0_TRIG012_PIO1_15
#undef DMA0_TRIG012_PIO1_16
#undef DMA0_TRIG012_PIO1_17
#undef DMA0_TRIG012_PIO1_18
#undef DMA0_TRIG012_PIO1_19
#undef DMA0_TRIG012_PIO1_20
#undef DMA0_TRIG012_PIO1_24
#undef DMA0_TRIG012_PIO1_26
#undef DMA0_TRIG012_PIO1_27
#undef DMA0_TRIG012_PIO1_28
#undef DMA0_TRIG012_PIO1_30
#undef DMA0_TRIG012_PIO1_31
#undef DMA0_TRIG012_PIO1_6
#undef DMA0_TRIG012_PIO1_7
#undef DMA0_TRIG012_PIO1_8
#undef DMA0_TRIG013_PIO0_17
#undef DMA0_TRIG013_PIO1_12
#undef DMA0_TRIG013_PIO1_13
#undef DMA0_TRIG013_PIO1_14
#undef DMA0_TRIG013_PIO1_15
#undef DMA0_TRIG013_PIO1_16
#undef DMA0_TRIG013_PIO1_17
#undef DMA0_TRIG013_PIO1_18
#undef DMA0_TRIG013_PIO1_19
#undef DMA0_TRIG013_PIO1_20
#undef DMA0_TRIG013_PIO1_24
#undef DMA0_TRIG013_PIO1_26
#undef DMA0_TRIG013_PIO1_27
#undef DMA0_TRIG013_PIO1_28
#undef DMA0_TRIG013_PIO1_30
#undef DMA0_TRIG013_PIO1_31
#undef DMA0_TRIG013_PIO1_6
#undef DMA0_TRIG013_PIO1_7
#undef DMA0_TRIG013_PIO1_8
#undef DMA0_TRIG014_PIO0_17
#undef DMA0_TRIG014_PIO1_12
#undef DMA0_TRIG014_PIO1_13
#undef DMA0_TRIG014_PIO1_14
#undef DMA0_TRIG014_PIO1_15
#undef DMA0_TRIG014_PIO1_16
#undef DMA0_TRIG014_PIO1_17
#undef DMA0_TRIG014_PIO1_18
#undef DMA0_TRIG014_PIO1_19
#undef DMA0_TRIG014_PIO1_20
#undef DMA0_TRIG014_PIO1_24
#undef DMA0_TRIG014_PIO1_26
#undef DMA0_TRIG014_PIO1_27
#undef DMA0_TRIG014_PIO1_28
#undef DMA0_TRIG014_PIO1_30
#undef DMA0_TRIG014_PIO1_31
#undef DMA0_TRIG014_PIO1_6
#undef DMA0_TRIG014_PIO1_7
#undef DMA0_TRIG014_PIO1_8
#undef DMA0_TRIG015_PIO0_17
#undef DMA0_TRIG015_PIO1_12
#undef DMA0_TRIG015_PIO1_13
#undef DMA0_TRIG015_PIO1_14
#undef DMA0_TRIG015_PIO1_15
#undef DMA0_TRIG015_PIO1_16
#undef DMA0_TRIG015_PIO1_17
#undef DMA0_TRIG015_PIO1_18
#undef DMA0_TRIG015_PIO1_19
#undef DMA0_TRIG015_PIO1_20
#undef DMA0_TRIG015_PIO1_24
#undef DMA0_TRIG015_PIO1_26
#undef DMA0_TRIG015_PIO1_27
#undef DMA0_TRIG015_PIO1_28
#undef DMA0_TRIG015_PIO1_30
#undef DMA0_TRIG015_PIO1_31
#undef DMA0_TRIG015_PIO1_6
#undef DMA0_TRIG015_PIO1_7
#undef DMA0_TRIG015_PIO1_8
#undef DMA0_TRIG016_PIO0_17
#undef DMA0_TRIG016_PIO1_12
#undef DMA0_TRIG016_PIO1_13
#undef DMA0_TRIG016_PIO1_14
#undef DMA0_TRIG016_PIO1_15
#undef DMA0_TRIG016_PIO1_16
#undef DMA0_TRIG016_PIO1_17
#undef DMA0_TRIG016_PIO1_18
#undef DMA0_TRIG016_PIO1_19
#undef DMA0_TRIG016_PIO1_20
#undef DMA0_TRIG016_PIO1_24
#undef DMA0_TRIG016_PIO1_26
#undef DMA0_TRIG016_PIO1_27
#undef DMA0_TRIG016_PIO1_28
#undef DMA0_TRIG016_PIO1_30
#undef DMA0_TRIG016_PIO1_31
#undef DMA0_TRIG016_PIO1_6
#undef DMA0_TRIG016_PIO1_7
#undef DMA0_TRIG016_PIO1_8
#undef DMA0_TRIG017_PIO0_17
#undef DMA0_TRIG017_PIO1_12
#undef DMA0_TRIG017_PIO1_13
#undef DMA0_TRIG017_PIO1_14
#undef DMA0_TRIG017_PIO1_15
#undef DMA0_TRIG017_PIO1_16
#undef DMA0_TRIG017_PIO1_17
#undef DMA0_TRIG017_PIO1_18
#undef DMA0_TRIG017_PIO1_19
#undef DMA0_TRIG017_PIO1_20
#undef DMA0_TRIG017_PIO1_24
#undef DMA0_TRIG017_PIO1_26
#undef DMA0_TRIG017_PIO1_27
#undef DMA0_TRIG017_PIO1_28
#undef DMA0_TRIG017_PIO1_30
#undef DMA0_TRIG017_PIO1_31
#undef DMA0_TRIG017_PIO1_6
#undef DMA0_TRIG017_PIO1_7
#undef DMA0_TRIG017_PIO1_8
#undef DMA0_TRIG018_PIO0_17
#undef DMA0_TRIG018_PIO1_12
#undef DMA0_TRIG018_PIO1_13
#undef DMA0_TRIG018_PIO1_14
#undef DMA0_TRIG018_PIO1_15
#undef DMA0_TRIG018_PIO1_16
#undef DMA0_TRIG018_PIO1_17
#undef DMA0_TRIG018_PIO1_18
#undef DMA0_TRIG018_PIO1_19
#undef DMA0_TRIG018_PIO1_20
#undef DMA0_TRIG018_PIO1_24
#undef DMA0_TRIG018_PIO1_26
#undef DMA0_TRIG018_PIO1_27
#undef DMA0_TRIG018_PIO1_28
#undef DMA0_TRIG018_PIO1_30
#undef DMA0_TRIG018_PIO1_31
#undef DMA0_TRIG018_PIO1_6
#undef DMA0_TRIG018_PIO1_7
#undef DMA0_TRIG018_PIO1_8
#undef DMA0_TRIG019_PIO0_17
#undef DMA0_TRIG019_PIO1_12
#undef DMA0_TRIG019_PIO1_13
#undef DMA0_TRIG019_PIO1_14
#undef DMA0_TRIG019_PIO1_15
#undef DMA0_TRIG019_PIO1_16
#undef DMA0_TRIG019_PIO1_17
#undef DMA0_TRIG019_PIO1_18
#undef DMA0_TRIG019_PIO1_19
#undef DMA0_TRIG019_PIO1_20
#undef DMA0_TRIG019_PIO1_24
#undef DMA0_TRIG019_PIO1_26
#undef DMA0_TRIG019_PIO1_27
#undef DMA0_TRIG019_PIO1_28
#undef DMA0_TRIG019_PIO1_30
#undef DMA0_TRIG019_PIO1_31
#undef DMA0_TRIG019_PIO1_6
#undef DMA0_TRIG019_PIO1_7
#undef DMA0_TRIG019_PIO1_8
#undef DMA0_TRIG01_PIO0_17
#undef DMA0_TRIG01_PIO1_12
#undef DMA0_TRIG01_PIO1_13
#undef DMA0_TRIG01_PIO1_14
#undef DMA0_TRIG01_PIO1_15
#undef DMA0_TRIG01_PIO1_16
#undef DMA0_TRIG01_PIO1_17
#undef DMA0_TRIG01_PIO1_18
#undef DMA0_TRIG01_PIO1_19
#undef DMA0_TRIG01_PIO1_20
#undef DMA0_TRIG01_PIO1_24
#undef DMA0_TRIG01_PIO1_26
#undef DMA0_TRIG01_PIO1_27
#undef DMA0_TRIG01_PIO1_28
#undef DMA0_TRIG01_PIO1_30
#undef DMA0_TRIG01_PIO1_31
#undef DMA0_TRIG01_PIO1_6
#undef DMA0_TRIG01_PIO1_7
#undef DMA0_TRIG01_PIO1_8
#undef DMA0_TRIG020_PIO0_17
#undef DMA0_TRIG020_PIO1_12
#undef DMA0_TRIG020_PIO1_13
#undef DMA0_TRIG020_PIO1_14
#undef DMA0_TRIG020_PIO1_15
#undef DMA0_TRIG020_PIO1_16
#undef DMA0_TRIG020_PIO1_17
#undef DMA0_TRIG020_PIO1_18
#undef DMA0_TRIG020_PIO1_19
#undef DMA0_TRIG020_PIO1_20
#undef DMA0_TRIG020_PIO1_24
#undef DMA0_TRIG020_PIO1_26
#undef DMA0_TRIG020_PIO1_27
#undef DMA0_TRIG020_PIO1_28
#undef DMA0_TRIG020_PIO1_30
#undef DMA0_TRIG020_PIO1_31
#undef DMA0_TRIG020_PIO1_6
#undef DMA0_TRIG020_PIO1_7
#undef DMA0_TRIG020_PIO1_8
#undef DMA0_TRIG021_PIO0_17
#undef DMA0_TRIG021_PIO1_12
#undef DMA0_TRIG021_PIO1_13
#undef DMA0_TRIG021_PIO1_14
#undef DMA0_TRIG021_PIO1_15
#undef DMA0_TRIG021_PIO1_16
#undef DMA0_TRIG021_PIO1_17
#undef DMA0_TRIG021_PIO1_18
#undef DMA0_TRIG021_PIO1_19
#undef DMA0_TRIG021_PIO1_20
#undef DMA0_TRIG021_PIO1_24
#undef DMA0_TRIG021_PIO1_26
#undef DMA0_TRIG021_PIO1_27
#undef DMA0_TRIG021_PIO1_28
#undef DMA0_TRIG021_PIO1_30
#undef DMA0_TRIG021_PIO1_31
#undef DMA0_TRIG021_PIO1_6
#undef DMA0_TRIG021_PIO1_7
#undef DMA0_TRIG021_PIO1_8
#undef DMA0_TRIG022_PIO0_17
#undef DMA0_TRIG022_PIO1_12
#undef DMA0_TRIG022_PIO1_13
#undef DMA0_TRIG022_PIO1_14
#undef DMA0_TRIG022_PIO1_15
#undef DMA0_TRIG022_PIO1_16
#undef DMA0_TRIG022_PIO1_17
#undef DMA0_TRIG022_PIO1_18
#undef DMA0_TRIG022_PIO1_19
#undef DMA0_TRIG022_PIO1_20
#undef DMA0_TRIG022_PIO1_24
#undef DMA0_TRIG022_PIO1_26
#undef DMA0_TRIG022_PIO1_27
#undef DMA0_TRIG022_PIO1_28
#undef DMA0_TRIG022_PIO1_30
#undef DMA0_TRIG022_PIO1_31
#undef DMA0_TRIG022_PIO1_6
#undef DMA0_TRIG022_PIO1_7
#undef DMA0_TRIG022_PIO1_8
#undef DMA0_TRIG02_PIO0_17
#undef DMA0_TRIG02_PIO1_12
#undef DMA0_TRIG02_PIO1_13
#undef DMA0_TRIG02_PIO1_14
#undef DMA0_TRIG02_PIO1_15
#undef DMA0_TRIG02_PIO1_16
#undef DMA0_TRIG02_PIO1_17
#undef DMA0_TRIG02_PIO1_18
#undef DMA0_TRIG02_PIO1_19
#undef DMA0_TRIG02_PIO1_20
#undef DMA0_TRIG02_PIO1_24
#undef DMA0_TRIG02_PIO1_26
#undef DMA0_TRIG02_PIO1_27
#undef DMA0_TRIG02_PIO1_28
#undef DMA0_TRIG02_PIO1_30
#undef DMA0_TRIG02_PIO1_31
#undef DMA0_TRIG02_PIO1_6
#undef DMA0_TRIG02_PIO1_7
#undef DMA0_TRIG02_PIO1_8
#undef DMA0_TRIG03_PIO0_17
#undef DMA0_TRIG03_PIO1_12
#undef DMA0_TRIG03_PIO1_13
#undef DMA0_TRIG03_PIO1_14
#undef DMA0_TRIG03_PIO1_15
#undef DMA0_TRIG03_PIO1_16
#undef DMA0_TRIG03_PIO1_17
#undef DMA0_TRIG03_PIO1_18
#undef DMA0_TRIG03_PIO1_19
#undef DMA0_TRIG03_PIO1_20
#undef DMA0_TRIG03_PIO1_24
#undef DMA0_TRIG03_PIO1_26
#undef DMA0_TRIG03_PIO1_27
#undef DMA0_TRIG03_PIO1_28
#undef DMA0_TRIG03_PIO1_30
#undef DMA0_TRIG03_PIO1_31
#undef DMA0_TRIG03_PIO1_6
#undef DMA0_TRIG03_PIO1_7
#undef DMA0_TRIG03_PIO1_8
#undef DMA0_TRIG04_PIO0_17
#undef DMA0_TRIG04_PIO1_12
#undef DMA0_TRIG04_PIO1_13
#undef DMA0_TRIG04_PIO1_14
#undef DMA0_TRIG04_PIO1_15
#undef DMA0_TRIG04_PIO1_16
#undef DMA0_TRIG04_PIO1_17
#undef DMA0_TRIG04_PIO1_18
#undef DMA0_TRIG04_PIO1_19
#undef DMA0_TRIG04_PIO1_20
#undef DMA0_TRIG04_PIO1_24
#undef DMA0_TRIG04_PIO1_26
#undef DMA0_TRIG04_PIO1_27
#undef DMA0_TRIG04_PIO1_28
#undef DMA0_TRIG04_PIO1_30
#undef DMA0_TRIG04_PIO1_31
#undef DMA0_TRIG04_PIO1_6
#undef DMA0_TRIG04_PIO1_7
#undef DMA0_TRIG04_PIO1_8
#undef DMA0_TRIG05_PIO0_17
#undef DMA0_TRIG05_PIO1_12
#undef DMA0_TRIG05_PIO1_13
#undef DMA0_TRIG05_PIO1_14
#undef DMA0_TRIG05_PIO1_15
#undef DMA0_TRIG05_PIO1_16
#undef DMA0_TRIG05_PIO1_17
#undef DMA0_TRIG05_PIO1_18
#undef DMA0_TRIG05_PIO1_19
#undef DMA0_TRIG05_PIO1_20
#undef DMA0_TRIG05_PIO1_24
#undef DMA0_TRIG05_PIO1_26
#undef DMA0_TRIG05_PIO1_27
#undef DMA0_TRIG05_PIO1_28
#undef DMA0_TRIG05_PIO1_30
#undef DMA0_TRIG05_PIO1_31
#undef DMA0_TRIG05_PIO1_6
#undef DMA0_TRIG05_PIO1_7
#undef DMA0_TRIG05_PIO1_8
#undef DMA0_TRIG06_PIO0_17
#undef DMA0_TRIG06_PIO1_12
#undef DMA0_TRIG06_PIO1_13
#undef DMA0_TRIG06_PIO1_14
#undef DMA0_TRIG06_PIO1_15
#undef DMA0_TRIG06_PIO1_16
#undef DMA0_TRIG06_PIO1_17
#undef DMA0_TRIG06_PIO1_18
#undef DMA0_TRIG06_PIO1_19
#undef DMA0_TRIG06_PIO1_20
#undef DMA0_TRIG06_PIO1_24
#undef DMA0_TRIG06_PIO1_26
#undef DMA0_TRIG06_PIO1_27
#undef DMA0_TRIG06_PIO1_28
#undef DMA0_TRIG06_PIO1_30
#undef DMA0_TRIG06_PIO1_31
#undef DMA0_TRIG06_PIO1_6
#undef DMA0_TRIG06_PIO1_7
#undef DMA0_TRIG06_PIO1_8
#undef DMA0_TRIG07_PIO0_17
#undef DMA0_TRIG07_PIO1_12
#undef DMA0_TRIG07_PIO1_13
#undef DMA0_TRIG07_PIO1_14
#undef DMA0_TRIG07_PIO1_15
#undef DMA0_TRIG07_PIO1_16
#undef DMA0_TRIG07_PIO1_17
#undef DMA0_TRIG07_PIO1_18
#undef DMA0_TRIG07_PIO1_19
#undef DMA0_TRIG07_PIO1_20
#undef DMA0_TRIG07_PIO1_24
#undef DMA0_TRIG07_PIO1_26
#undef DMA0_TRIG07_PIO1_27
#undef DMA0_TRIG07_PIO1_28
#undef DMA0_TRIG07_PIO1_30
#undef DMA0_TRIG07_PIO1_31
#undef DMA0_TRIG07_PIO1_6
#undef DMA0_TRIG07_PIO1_7
#undef DMA0_TRIG07_PIO1_8
#undef DMA0_TRIG08_PIO0_17
#undef DMA0_TRIG08_PIO1_12
#undef DMA0_TRIG08_PIO1_13
#undef DMA0_TRIG08_PIO1_14
#undef DMA0_TRIG08_PIO1_15
#undef DMA0_TRIG08_PIO1_16
#undef DMA0_TRIG08_PIO1_17
#undef DMA0_TRIG08_PIO1_18
#undef DMA0_TRIG08_PIO1_19
#undef DMA0_TRIG08_PIO1_20
#undef DMA0_TRIG08_PIO1_24
#undef DMA0_TRIG08_PIO1_26
#undef DMA0_TRIG08_PIO1_27
#undef DMA0_TRIG08_PIO1_28
#undef DMA0_TRIG08_PIO1_30
#undef DMA0_TRIG08_PIO1_31
#undef DMA0_TRIG08_PIO1_6
#undef DMA0_TRIG08_PIO1_7
#undef DMA0_TRIG08_PIO1_8
#undef DMA0_TRIG09_PIO0_17
#undef DMA0_TRIG09_PIO1_12
#undef DMA0_TRIG09_PIO1_13
#undef DMA0_TRIG09_PIO1_14
#undef DMA0_TRIG09_PIO1_15
#undef DMA0_TRIG09_PIO1_16
#undef DMA0_TRIG09_PIO1_17
#undef DMA0_TRIG09_PIO1_18
#undef DMA0_TRIG09_PIO1_19
#undef DMA0_TRIG09_PIO1_20
#undef DMA0_TRIG09_PIO1_24
#undef DMA0_TRIG09_PIO1_26
#undef DMA0_TRIG09_PIO1_27
#undef DMA0_TRIG09_PIO1_28
#undef DMA0_TRIG09_PIO1_30
#undef DMA0_TRIG09_PIO1_31
#undef DMA0_TRIG09_PIO1_6
#undef DMA0_TRIG09_PIO1_7
#undef DMA0_TRIG09_PIO1_8
#undef DMA1_TRIG10_PIO0_17
#undef DMA1_TRIG10_PIO1_12
#undef DMA1_TRIG10_PIO1_13
#undef DMA1_TRIG10_PIO1_14
#undef DMA1_TRIG10_PIO1_15
#undef DMA1_TRIG10_PIO1_16
#undef DMA1_TRIG10_PIO1_17
#undef DMA1_TRIG10_PIO1_18
#undef DMA1_TRIG10_PIO1_19
#undef DMA1_TRIG10_PIO1_20
#undef DMA1_TRIG10_PIO1_24
#undef DMA1_TRIG10_PIO1_26
#undef DMA1_TRIG10_PIO1_27
#undef DMA1_TRIG10_PIO1_28
#undef DMA1_TRIG10_PIO1_30
#undef DMA1_TRIG10_PIO1_31
#undef DMA1_TRIG10_PIO1_6
#undef DMA1_TRIG10_PIO1_7
#undef DMA1_TRIG10_PIO1_8
#undef DMA1_TRIG11_PIO0_17
#undef DMA1_TRIG11_PIO1_12
#undef DMA1_TRIG11_PIO1_13
#undef DMA1_TRIG11_PIO1_14
#undef DMA1_TRIG11_PIO1_15
#undef DMA1_TRIG11_PIO1_16
#undef DMA1_TRIG11_PIO1_17
#undef DMA1_TRIG11_PIO1_18
#undef DMA1_TRIG11_PIO1_19
#undef DMA1_TRIG11_PIO1_20
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_28
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG11_PIO1_6
#undef DMA1_TRIG11_PIO1_7
#undef DMA1_TRIG11_PIO1_8
#undef DMA1_TRIG12_PIO0_17
#undef DMA1_TRIG12_PIO1_12
#undef DMA1_TRIG12_PIO1_13
#undef DMA1_TRIG12_PIO1_14
#undef DMA1_TRIG12_PIO1_15
#undef DMA1_TRIG12_PIO1_16
#undef DMA1_TRIG12_PIO1_17
#undef DMA1_TRIG12_PIO1_18
#undef DMA1_TRIG12_PIO1_19
#undef DMA1_TRIG12_PIO1_20
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_28
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG12_PIO1_6
#undef DMA1_TRIG12_PIO1_7
#undef DMA1_TRIG12_PIO1_8
#undef DMA1_TRIG13_PIO0_17
#undef DMA1_TRIG13_PIO1_12
#undef DMA1_TRIG13_PIO1_13
#undef DMA1_TRIG13_PIO1_14
#undef DMA1_TRIG13_PIO1_15
#undef DMA1_TRIG13_PIO1_16
#undef DMA1_TRIG13_PIO1_17
#undef DMA1_TRIG13_PIO1_18
#undef DMA1_TRIG13_PIO1_19
#undef DMA1_TRIG13_PIO1_20
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_28
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG13_PIO1_6
#undef DMA1_TRIG13_PIO1_7
#undef DMA1_TRIG13_PIO1_8
#undef DMA1_TRIG14_PIO0_17
#undef DMA1_TRIG14_PIO1_12
#undef DMA1_TRIG14_PIO1_13
#undef DMA1_TRIG14_PIO1_14
#undef DMA1_TRIG14_PIO1_15
#undef DMA1_TRIG14_PIO1_16
#undef DMA1_TRIG14_PIO1_17
#undef DMA1_TRIG14_PIO1_18
#undef DMA1_TRIG14_PIO1_19
#undef DMA1_TRIG14_PIO1_20
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_28
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG14_PIO1_6
#undef DMA1_TRIG14_PIO1_7
#undef DMA1_TRIG14_PIO1_8
#undef DMA1_TRIG15_PIO0_17
#undef DMA1_TRIG15_PIO1_12
#undef DMA1_TRIG15_PIO1_13
#undef DMA1_TRIG15_PIO1_14
#undef DMA1_TRIG15_PIO1_15
#undef DMA1_TRIG15_PIO1_16
#undef DMA1_TRIG15_PIO1_17
#undef DMA1_TRIG15_PIO1_18
#undef DMA1_TRIG15_PIO1_19
#undef DMA1_TRIG15_PIO1_20
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_28
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG15_PIO1_6
#undef DMA1_TRIG15_PIO1_7
#undef DMA1_TRIG15_PIO1_8
#undef DMA1_TRIG16_PIO0_17
#undef DMA1_TRIG16_PIO1_12
#undef DMA1_TRIG16_PIO1_13
#undef DMA1_TRIG16_PIO1_14
#undef DMA1_TRIG16_PIO1_15
#undef DMA1_TRIG16_PIO1_16
#undef DMA1_TRIG16_PIO1_17
#undef DMA1_TRIG16_PIO1_18
#undef DMA1_TRIG16_PIO1_19
#undef DMA1_TRIG16_PIO1_20
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_28
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG16_PIO1_6
#undef DMA1_TRIG16_PIO1_7
#undef DMA1_TRIG16_PIO1_8
#undef DMA1_TRIG17_PIO0_17
#undef DMA1_TRIG17_PIO1_12
#undef DMA1_TRIG17_PIO1_13
#undef DMA1_TRIG17_PIO1_14
#undef DMA1_TRIG17_PIO1_15
#undef DMA1_TRIG17_PIO1_16
#undef DMA1_TRIG17_PIO1_17
#undef DMA1_TRIG17_PIO1_18
#undef DMA1_TRIG17_PIO1_19
#undef DMA1_TRIG17_PIO1_20
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_28
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG17_PIO1_6
#undef DMA1_TRIG17_PIO1_7
#undef DMA1_TRIG17_PIO1_8
#undef DMA1_TRIG18_PIO0_17
#undef DMA1_TRIG18_PIO1_12
#undef DMA1_TRIG18_PIO1_13
#undef DMA1_TRIG18_PIO1_14
#undef DMA1_TRIG18_PIO1_15
#undef DMA1_TRIG18_PIO1_16
#undef DMA1_TRIG18_PIO1_17
#undef DMA1_TRIG18_PIO1_18
#undef DMA1_TRIG18_PIO1_19
#undef DMA1_TRIG18_PIO1_20
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_28
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG18_PIO1_6
#undef DMA1_TRIG18_PIO1_7
#undef DMA1_TRIG18_PIO1_8
#undef DMA1_TRIG19_PIO0_17
#undef DMA1_TRIG19_PIO1_12
#undef DMA1_TRIG19_PIO1_13
#undef DMA1_TRIG19_PIO1_14
#undef DMA1_TRIG19_PIO1_15
#undef DMA1_TRIG19_PIO1_16
#undef DMA1_TRIG19_PIO1_17
#undef DMA1_TRIG19_PIO1_18
#undef DMA1_TRIG19_PIO1_19
#undef DMA1_TRIG19_PIO1_20
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_28
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG19_PIO1_6
#undef DMA1_TRIG19_PIO1_7
#undef DMA1_TRIG19_PIO1_8
#undef FC0_CTS_SDA_SSEL0_PIO1_8
#undef FC0_RTS_SCL_SSEL1_PIO1_7
#undef FC0_TXD_SCL_MISO_WS_PIO1_6
#undef FC2_CTS_SDA_SSEL0_PIO1_26
#undef FC2_RTS_SCL_SSEL1_PIO1_27
#undef FC2_RXD_SDA_MOSI_DATA_PIO1_24
#undef FC3_SSEL3_PIO1_24
#undef FC4_RTS_SCL_SSEL1_PIO1_15
#undef FC4_SCK_PIO1_19
#undef FC4_SSEL2_PIO0_17
#undef FC4_SSEL2_PIO1_8
#undef FC4_TXD_SCL_MISO_WS_PIO1_20
#undef FC5_CTS_SDA_SSEL0_PIO1_14
#undef FC5_RTS_SCL_SSEL1_PIO1_15
#undef FC6_RTS_SCL_SSEL1_PIO1_17
#undef FC6_RXD_SDA_MOSI_DATA_PIO1_13
#undef FC6_SCK_PIO1_12
#undef FC6_TXD_SCL_MISO_WS_PIO1_16
#undef FC7_RTS_SCL_SSEL1_PIO1_20
#undef FC7_SCK_PIO1_28
#undef FC7_TXD_SCL_MISO_WS_PIO1_30
#undef GPIO_PIO017_PIO0_17
#undef GPIO_PIO112_PIO1_12
#undef GPIO_PIO113_PIO1_13
#undef GPIO_PIO114_PIO1_14
#undef GPIO_PIO115_PIO1_15
#undef GPIO_PIO116_PIO1_16
#undef GPIO_PIO117_PIO1_17
#undef GPIO_PIO118_PIO1_18
#undef GPIO_PIO119_PIO1_19
#undef GPIO_PIO120_PIO1_20
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO128_PIO1_28
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO16_PIO1_6
#undef GPIO_PIO17_PIO1_7
#undef GPIO_PIO18_PIO1_8
#undef HS_SPI_SSEL2_PIO1_12
#undef HS_SPI_SSEL3_PIO1_26
#undef MCLK_PIO1_31
#undef PINT_PINT0_PIO0_17
#undef PINT_PINT0_PIO1_12
#undef PINT_PINT0_PIO1_13
#undef PINT_PINT0_PIO1_14
#undef PINT_PINT0_PIO1_15
#undef PINT_PINT0_PIO1_16
#undef PINT_PINT0_PIO1_17
#undef PINT_PINT0_PIO1_18
#undef PINT_PINT0_PIO1_19
#undef PINT_PINT0_PIO1_20
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_28
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT0_PIO1_6
#undef PINT_PINT0_PIO1_7
#undef PINT_PINT0_PIO1_8
#undef PINT_PINT1_PIO0_17
#undef PINT_PINT1_PIO1_12
#undef PINT_PINT1_PIO1_13
#undef PINT_PINT1_PIO1_14
#undef PINT_PINT1_PIO1_15
#undef PINT_PINT1_PIO1_16
#undef PINT_PINT1_PIO1_17
#undef PINT_PINT1_PIO1_18
#undef PINT_PINT1_PIO1_19
#undef PINT_PINT1_PIO1_20
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_28
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT1_PIO1_6
#undef PINT_PINT1_PIO1_7
#undef PINT_PINT1_PIO1_8
#undef PINT_PINT2_PIO0_17
#undef PINT_PINT2_PIO1_12
#undef PINT_PINT2_PIO1_13
#undef PINT_PINT2_PIO1_14
#undef PINT_PINT2_PIO1_15
#undef PINT_PINT2_PIO1_16
#undef PINT_PINT2_PIO1_17
#undef PINT_PINT2_PIO1_18
#undef PINT_PINT2_PIO1_19
#undef PINT_PINT2_PIO1_20
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_28
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT2_PIO1_6
#undef PINT_PINT2_PIO1_7
#undef PINT_PINT2_PIO1_8
#undef PINT_PINT3_PIO0_17
#undef PINT_PINT3_PIO1_12
#undef PINT_PINT3_PIO1_13
