zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC5506JBD64-pinctrl.h
#undef PINT_PINT3_PIO1_14
#undef PINT_PINT3_PIO1_15
#undef PINT_PINT3_PIO1_16
#undef PINT_PINT3_PIO1_17
#undef PINT_PINT3_PIO1_18
#undef PINT_PINT3_PIO1_19
#undef PINT_PINT3_PIO1_20
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_28
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT3_PIO1_6
#undef PINT_PINT3_PIO1_7
#undef PINT_PINT3_PIO1_8
#undef PINT_PINT4_PIO0_17
#undef PINT_PINT4_PIO1_12
#undef PINT_PINT4_PIO1_13
#undef PINT_PINT4_PIO1_14
#undef PINT_PINT4_PIO1_15
#undef PINT_PINT4_PIO1_16
#undef PINT_PINT4_PIO1_17
#undef PINT_PINT4_PIO1_18
#undef PINT_PINT4_PIO1_19
#undef PINT_PINT4_PIO1_20
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_28
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT4_PIO1_6
#undef PINT_PINT4_PIO1_7
#undef PINT_PINT4_PIO1_8
#undef PINT_PINT5_PIO0_17
#undef PINT_PINT5_PIO1_12
#undef PINT_PINT5_PIO1_13
#undef PINT_PINT5_PIO1_14
#undef PINT_PINT5_PIO1_15
#undef PINT_PINT5_PIO1_16
#undef PINT_PINT5_PIO1_17
#undef PINT_PINT5_PIO1_18
#undef PINT_PINT5_PIO1_19
#undef PINT_PINT5_PIO1_20
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_28
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT5_PIO1_6
#undef PINT_PINT5_PIO1_7
#undef PINT_PINT5_PIO1_8
#undef PINT_PINT6_PIO0_17
#undef PINT_PINT6_PIO1_12
#undef PINT_PINT6_PIO1_13
#undef PINT_PINT6_PIO1_14
#undef PINT_PINT6_PIO1_15
#undef PINT_PINT6_PIO1_16
#undef PINT_PINT6_PIO1_17
#undef PINT_PINT6_PIO1_18
#undef PINT_PINT6_PIO1_19
#undef PINT_PINT6_PIO1_20
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_28
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT6_PIO1_6
#undef PINT_PINT6_PIO1_7
#undef PINT_PINT6_PIO1_8
#undef PINT_PINT7_PIO0_17
#undef PINT_PINT7_PIO1_12
#undef PINT_PINT7_PIO1_13
#undef PINT_PINT7_PIO1_14
#undef PINT_PINT7_PIO1_15
#undef PINT_PINT7_PIO1_16
#undef PINT_PINT7_PIO1_17
#undef PINT_PINT7_PIO1_18
#undef PINT_PINT7_PIO1_19
#undef PINT_PINT7_PIO1_20
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_28
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PINT_PINT7_PIO1_6
#undef PINT_PINT7_PIO1_7
#undef PINT_PINT7_PIO1_8
#undef PLU_INPUT0_PIO1_31
#undef PLU_INPUT1_PIO1_30
#undef PLU_INPUT2_PIO0_17
#undef PLU_INPUT3_PIO1_28
#undef PLU_INPUT4_PIO1_27
#undef PLU_INPUT5_PIO1_26
#undef PLU_OUT0_PIO1_18
#undef PLU_OUT1_PIO1_19
#undef PLU_OUT2_PIO1_20
#undef PLU_OUT6_PIO1_24
#undef PMC_ACMP_IN4_PIO1_14
#undef SCT0_IN0_PIO0_17
#undef SCT0_IN0_PIO1_19
#undef SCT0_IN0_PIO1_30
#undef SCT0_IN0_PIO1_6
#undef SCT0_IN0_PIO1_7
#undef SCT0_IN1_PIO0_17
#undef SCT0_IN1_PIO1_19
#undef SCT0_IN1_PIO1_30
#undef SCT0_IN1_PIO1_6
#undef SCT0_IN1_PIO1_7
#undef SCT0_IN2_PIO0_17
#undef SCT0_IN2_PIO1_19
#undef SCT0_IN2_PIO1_30
#undef SCT0_IN2_PIO1_6
#undef SCT0_IN2_PIO1_7
#undef SCT0_IN3_PIO0_17
#undef SCT0_IN3_PIO1_19
#undef SCT0_IN3_PIO1_30
#undef SCT0_IN3_PIO1_6
#undef SCT0_IN3_PIO1_7
#undef SCT0_IN4_PIO0_17
#undef SCT0_IN4_PIO1_19
#undef SCT0_IN4_PIO1_30
#undef SCT0_IN4_PIO1_6
#undef SCT0_IN4_PIO1_7
#undef SCT0_IN5_PIO0_17
#undef SCT0_IN5_PIO1_19
#undef SCT0_IN5_PIO1_30
#undef SCT0_IN5_PIO1_6
#undef SCT0_IN5_PIO1_7
#undef SCT0_IN6_PIO0_17
#undef SCT0_IN6_PIO1_19
#undef SCT0_IN6_PIO1_30
#undef SCT0_IN6_PIO1_6
#undef SCT0_IN6_PIO1_7
#undef SCT0_OUT0_PIO0_17
#undef SCT0_OUT1_PIO1_24
#undef SCT0_OUT1_PIO1_8
#undef SCT0_OUT3_PIO1_26
#undef SCT0_OUT4_PIO1_17
#undef SCT0_OUT5_PIO1_18
#undef SCT0_OUT6_PIO1_31
#undef SCT0_OUT7_PIO1_19
#undef SD0_CARD_DET_N_PIO0_17
#undef SD0_CARD_DET_N_PIO1_13
#undef SD0_CARD_INT_N_PIO0_17
#undef SD0_CLK_PIO0_7
#undef SD0_CLK_PIO1_8
#undef SD0_CMD_PIO0_8
#undef SD0_CMD_PIO1_16
#undef SD0_CMD_PIO1_22
#undef SD0_POW_EN_PIO0_12
#undef SD0_POW_EN_PIO0_9
#undef SD0_WR_PRT_PIO0_15
#undef SD0_WR_PRT_PIO0_18
#undef SD1_BACKEND_PWR_PIO0_12
#undef SD1_CARD_DET_N_PIO1_17
#undef SD1_CARD_INT_N_PIO0_0
#undef SD1_CARD_INT_N_PIO1_17
#undef SD1_CLK_PIO0_1
#undef SD1_CLK_PIO1_31
#undef SD1_CMD_PIO0_28
#undef SD1_CMD_PIO1_14
#undef SD1_POW_EN_PIO1_18
#undef SDIF_SD0_D0_PIO0_24
#undef SDIF_SD0_D0_PIO1_4
#undef SDIF_SD0_D1_PIO0_25
#undef SDIF_SD0_D1_PIO1_7
#undef SDIF_SD0_D2_PIO0_31
#undef SDIF_SD0_D2_PIO1_5
#undef SDIF_SD0_D3_PIO1_0
#undef SDIF_SD0_D3_PIO1_6
#undef SDIF_SD0_D4_PIO1_27
#undef SDIF_SD0_D5_PIO1_28
#undef SDIF_SD0_D6_PIO1_29
#undef SDIF_SD0_D7_PIO1_30
#undef SDIF_SD1_D0_PIO0_22
#undef SDIF_SD1_D0_PIO1_25
#undef SDIF_SD1_D1_PIO0_23
#undef SDIF_SD1_D1_PIO1_24
#undef SDIF_SD1_D2_PIO0_29
#undef SDIF_SD1_D2_PIO1_15
#undef SDIF_SD1_D3_PIO0_30
#undef SDIF_SD1_D3_PIO1_23
#undef SECGPIO_SECPIO017_PIO0_17
#undef SECPINT_SECPINT0_PIO0_17
#undef SECPINT_SECPINT1_PIO0_17
#undef USB0_FRAME_PIO1_13
#undef USB0_IDVALUE_PIO0_26
#undef USB0_LEDN_PIO1_14
#undef USB0_OVERCURRENTN_PIO0_28
#undef USB0_OVERCURRENTN_PIO1_13
#undef USB0_PORTPWRN_PIO1_12
#undef USB0_PORTPWRN_PIO1_3
#undef USB0_VBUS_PIO0_22
#undef USB0_VBUS_PIO1_11
#undef USB1_FRAME_PIO1_29
#undef USB1_LEDN_PIO1_30
#undef USB1_OVERCURRENTN_PIO1_1
#undef USB1_OVERCURRENTN_PIO1_30
#undef USB1_PORTPWRN_PIO1_2
#undef USB1_PORTPWRN_PIO1_29
#undef UTICK0_CAPTURE1_PIO1_26
#undef UTICK0_CAPTURE2_PIO1_14
#undef UTICK0_CAPTURE3_PIO1_15

/* Signals specific to this part */
#define CAN0_RD_PIO0_4 IOCON_MUX(4, IOCON_TYPE_D, 1)
#define CAN0_RD_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 9)
#define CAN0_RD_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 1)
#define CAN0_TD_PIO0_5 IOCON_MUX(5, IOCON_TYPE_D, 1)
#define CAN0_TD_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 1)
#define HS_SPI_SSEL3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 8)

#endif /* _ZEPHYR_DTS_BINDING_LPC5506JBD64_WRAPPER_ */
